## Question-1: create a pandas series that contain the following data : 4,8,16,23and 42.then,print the series.

In [1]:
import pandas as pd

In [2]:
pip install pandas

Requirement already satisfied: pandas in /opt/conda/lib/python3.10/site-packages (1.5.2)
Requirement already satisfied: python-dateutil>=2.8.1 in /opt/conda/lib/python3.10/site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in /opt/conda/lib/python3.10/site-packages (from pandas) (2022.6)
Requirement already satisfied: numpy>=1.21.0 in /opt/conda/lib/python3.10/site-packages (from pandas) (1.23.5)
Requirement already satisfied: six>=1.5 in /opt/conda/lib/python3.10/site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [4]:
s1=pd.Series([4,8,16,23],index=[0,1,2,3])

In [5]:
s1

0     4
1     8
2    16
3    23
dtype: int64

## Question-2: Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the variable print it.

In [10]:
l=[1,2,3,4,5,6,7,8,9,10]

In [11]:
pd.Series(l)

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

## Question-4:What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

In [12]:
##Series can only contain single list with index, whereas dataframe can be made of more than one series or we can say that a dataframe is a collection of series that can be used to analyse the data.

In [13]:
l=[1,2,3,4,5,6,7,8,9,10]

In [15]:
pd.Series(l)

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

## Question-5:What are some common functions you can use to manipulate data in a Pandas DataFrame? Can you give an example of when you might use one of these functions?

In [16]:
## read_csv() This is one of the most crucial pandas methods in Python

In [17]:
## head() head(n) is used to return the first n rows of a dataset.

In [18]:
## tail()

In [19]:
## describe()

In [20]:
## drop()

In [21]:
df=pd.read_csv("data.csv")

In [22]:
df.head()

    name         email_id  phone_number
0   sudh   sudh@gamil.com      88654356
1  krish  krish@gmail.com     868455487

In [23]:
df.tail()

    name         email_id  phone_number
0   sudh   sudh@gamil.com      88654356
1  krish  krish@gmail.com     868455487

In [31]:
df.drop("name",axis=1)

          email_id  phone_number
0   sudh@gamil.com      88654356
1  krish@gmail.com     868455487

## Question-6 Which of the following is mutable in nature Series, DataFrame, Panel?

In [32]:
## All Pandas data structures are value mutable (can be changed) and except Series all are size mutable. Series is size immutable. Note − DataFrame is widely used and one of the most important data structures.

## Question-3: Create a Pandas DataFrame that contains the following data:

## Then, print the DataFrame.

In [34]:
d={'Name':['Alice','Bob','Claire'],'Age':[25,30,27],'Gender':['female','male','female']}

In [35]:
pd.DataFrame(d)

     Name  Age  Gender
0   Alice   25  female
1     Bob   30    male
2  Claire   27  female

## Question-7: Create a DataFrame using multiple Series. Explain with an example.

In [36]:
import pandas as pd
# Create pandas Series
courses = pd.Series(["Spark","PySpark","Hadoop"])
fees = pd.Series([22000,25000,23000])
discount  = pd.Series([1000,2300,1000])

# Combine two series.
df=pd.concat([courses,fees],axis=1)

# It also supports to combine multiple series.
df=pd.concat([courses,fees,discount],axis=1)
print(df)

         0      1     2
0    Spark  22000  1000
1  PySpark  25000  2300
2   Hadoop  23000  1000